{
  "posts": [
     { "id": 1, "thread":1, "user": 1, "date": "2021-01-29 15:39:15",
      "content": "faible moi ? serieusement ^^ haha on me l avait pas sortie celle la depuis loooongtemps :) demande a mes potes si je suis faible tu vas voir les reponses que tu vas te prendre XD rien que la semaine passee j ai soulevé donc chuuuuut ferme la faible de merde car oui toi tu m as tout l air d un bon faible de merde car souvent vous etes frustrer de ne pas avoir de MUSCLES :) ses agreable de soulever des haltères ou un faire des pompes avec ses potes hein? tu peux pas repondre car tu ne sais pas ce que c ou alors tu le sais mais tu as du taper dans ta barre de recherche \"haltères muscles\" ou \"pompes muscles\" pour comprendre ce que c etait mdddrrr !! c est grave quoiquil en soit.... pour revenir a moi, je pense que je suis le mec le moins faible de ma bande de 11 meilleurs amis pas psk j ai le plus de muscles mais psk j ai fais les meilleurs exercices que mes amis :D ses pas moi qui le dit, ses eux qui commente sous mes photos insta \"trop belle la pompe que tu as fait hier en salle notamment!\" donc apres si tu veux que sa parte plus loi sa peut partir vraiment loi j habite dans la banlieue de niort sa te parle steven sanchez ? ses juste un cousin donc OKLM hahaha on verra si tu parles encore le faible de merde mdddrrr pk insulter qd on est soi meme faible tu me feras toujour marrer!!"
    },
    { "id": 2, "thread":1, "user": 2, "date": "2021-01-29 15:51:23",
      "content": "??? Fréro il t'arrives quoi ?"
    },
    { "id": 3, "thread":1, "user": 3, "date": "2021-01-29 15:56:42",
      "content": "feur"
    },
    { "id": 4, "thread":1, "user": 2, "date": "2021-01-29 16:02:06",
      "content": "ah ok"
    }
  ],
 "threads": {
    "id": 1, "title": "Alors comme ça on me traite de FAIBLE ?", "first": 1
  },
  "users": [
    { "id": 1, "username": "Issoucisse" },
    { "id": 2, "username": "Temsoka" },
    { "id": 3, "username": "Tintintamarre" }
  ],
  "categories": [
    { "id": 0, "name": "Site", "parent": 0 },
    { "id": 1, "name": "Général", "parent": 0 }
  ],
  "subcategories": [
    { "id": 0, "name": "Annonces", "parent": 0, "description": "Cette section regroupe toutes les annonces importantes du forum." },
    { "id": 1, "name": "Suggestions", "parent": 0, "description": "Vous avez une suggestion pour le site ? Vous pouvez la proposer ici." },
    { "id": 2, "name": "Signaler un bug", "parent": 0, "description": "Vous avez rencontré un problème ? Signalez-le ici." },
    { "id": 3, "name": "Aide aux exercices", "parent": 1, "description": "Vous avez des questions par rapport à un exercice ? Vous pouvez obtenir de l'aide auprès de nos membres ici." },
    { "id": 4, "name": "Discussions générales", "parent": 1, "description": "Pour discuter sujet sérieux." },
    { "id": 5, "name": "Forum libre", "parent": 1, "description": "Pour discuter de tout et de rien." }
  ]
}
